app/controllers/stories_controller.rb

  def create
    @story = Story.new(story_params)

    if @story.save
---
INSERT INTO "stories" ("title", "summary", "place_of_origin", "date_of_origin", "story", "user_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6, $7, $8) RETURNING "id"

    def set_story
      @story = Story.find(params[:id])
---
SELECT "stories".* FROM "stories" WHERE "stories"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]