app/controllers/users_controller.rb

INSERT INTO "users" ("username", "email", "password_digest") VALUES ($1, $2, $3) RETURNING "id"  [["username", "r.cosenza39@gmail.com"], ["email", "r.cosenza39@gmail.com"], ["password_digest", "$2a$12$jeMLqFSOVnrbMGjmRrRNTuxQLlUtrLbQNHCvClweSqF7ClFEvK7c6"]]
---
  def create
    @user = User.new(user_params)

    if @user.save

INSERT INTO "favorites" ("user_id", "story_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["user_id", 1], ["story_id", 1], ["created_at", "2020-04-15 04:27:41.483407"], ["updated_at", "2020-04-15 04:27:41.483407"]]
---
  def add_favorite
    @favorite = Favorite.new(favorite_params)

    if @favorite.save